app/views/consulta/_form.html.erb

    <%= form.label :medico_id %>
    <%= form.collection_select(:medico_id, Medico.all, :id, :nome,{:selected => @consultum.medico_id})%>
---
SELECT "medicos".* FROM "medicos"

    <%= form.label :paciente_id %>
    <%= form.collection_select(:paciente_id, Paciente.all, :id, :nome,{:selected => @consultum.paciente_id})%>
---
SELECT "pacientes".* FROM "pacientes"