app/controllers/consulta_controller.rb

  def create
    @paciente = Paciente.find(consultum_params[:paciente_id])
    @medico = Medico.find(consultum_params[:medico_id])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]