app/controllers/medicos_controller.rb

SELECT "medicos".* FROM "medicos"
---
  def index
    @medicos = Medico.all

INSERT INTO "medicos" ("nome", "cpf", "email", "especialidade", "CRM", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nome", "Giu2"], ["cpf", "ss"], ["email", "s"], ["especialidade", "s"], ["CRM", "s"], ["created_at", "2023-06-19 20:10:57.436021"], ["updated_at", "2023-06-19 20:10:57.436021"]]
---
  def create
    @medico = Medico.new(medico_params)

    respond_to do |format|
      if @medico.save

DELETE FROM "medicos" WHERE "medicos"."id" = ?  [["id", 1]]
---
  def destroy
    @medico.destroy

SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_medico
      @medico = Medico.find(params[:id])