app/controllers/pacientes_controller.rb

  def edit
    @paciente = Paciente.find(params[:id])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def create
    @paciente = Paciente.new(paciente_params)
    @paciente.endereco = Endereco.new(paciente_params[:endereco_attributes])

    respond_to do |format|
      if @paciente.save
---
INSERT INTO "enderecos" ("cep", "cidade", "bairro", "logradouro", "complemento", "paciente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pacientes" ("nome", "data", "cpf", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", nil], ["data", nil], ["cpf", "s"], ["email", "s"], ["created_at", "2023-06-19 19:39:30.282261"], ["updated_at", "2023-06-19 19:39:30.282261"]]

  def update
    @paciente = Paciente.find(params[:id])
    respond_to do |format|
      if @paciente.update(paciente_params)
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "pacientes" SET "cpf" = ?, "updated_at" = ? WHERE "pacientes"."id" = ?  [["cpf", "66666666667"], ["updated_at", "2023-06-21 19:12:21.600970"], ["id", 9]]

  def destroy
    @paciente = Paciente.find(params[:id])
    @paciente.destroy
    @paciente.endereco.destroy
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "pacientes" WHERE "pacientes"."id" = ?  [["id", 2]]
DELETE FROM "enderecos" WHERE "enderecos"."id" = ?  [["id", 1]]

  def set_paciente
    @paciente = Paciente.find(params[:id])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]